// 서울시의 구 리스트
const districts = [
    '강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구',
    '노원구', '도봉구', '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구',
    '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구',
  ];

// 각 구의 좌표 설정
const districtCoordinates = {
    강남구: { lat: 37.5172, lng: 127.0473 },
    강동구: { lat: 37.5301, lng: 127.1238 },
    강북구: { lat: 37.6396, lng: 127.0257 },
    강서구: { lat: 37.5509, lng: 126.8495 },
    관악구: { lat: 37.4784, lng: 126.9514 },
    광진구: { lat: 37.5384, lng: 127.0823 },
    구로구: { lat: 37.4955, lng: 126.8875 },
    금천구: { lat: 37.4569, lng: 126.8955 },
    노원구: { lat: 37.6544, lng: 127.0564 },
    도봉구: { lat: 37.6688, lng: 127.0466 },
    동대문구: { lat: 37.5744, lng: 127.0399 },
    동작구: { lat: 37.5124, lng: 126.9393 },
    마포구: { lat: 37.5638, lng: 126.9084 },
    서대문구: { lat: 37.5791, lng: 126.9368 },
    서초구: { lat: 37.4836, lng: 127.0327 },
    성동구: { lat: 37.5502, lng: 127.0413 },
    성북구: { lat: 37.5894, lng: 127.0167 },
    송파구: { lat: 37.5145, lng: 127.1054 },
    양천구: { lat: 37.5162, lng: 126.8665 },
    영등포구: { lat: 37.5262, lng: 126.8962 },
    용산구: { lat: 37.5324, lng: 126.9903 },
    은평구: { lat: 37.6176, lng: 126.9227 },
    종로구: { lat: 37.5735, lng: 126.9792 },
    중구: { lat: 37.5637, lng: 126.9973 },
    중랑구: { lat: 37.6063, lng: 127.0923 },
};

export default { districts, districtCoordinates };